{
  "weapon": [
    {
      "name": "Excalibur",
      "uses": "Infinity",
      "ticks": 1,
      "slots": 2,
      "damage": 7,
      "class": [
        "Warrior"
      ],
      "description": "You could have been the ruler of England, but that offer expired centuries ago. Still you can emit a 7 hexes ray of light that deals 7 holy damage to the enemies in the line. Cooldown 10 ticks.",
      "note": "Hail, King Arthur! Long live the king!"
    },
    {
      "name": "Blowtorch",
      "uses": 20,
      "description": "The Blowtorch can be switched on or off with a 1 tick action. Any unit in front of a flame produced by this item is dealt 3 fire damage. Additionally, you gain the ability Yeah, I got that there: with a 5 ticks atomic action, you can pierce a wall or the floor in a chosen point.\nEach tick this weapon stays on consumes 1 use.",
      "note": "Got it!"
    },
    {
      "name": "Ram",
      "uses": 5,
      "ticks": 1,
      "damage": 3,
      "description": "There is a 25% chance an enemy hit by the Ram stays stunned the next tick. You can also spend 1 use to perform a 3 ticks suspendable action to break down a closed door.",
      "note": "Break it down? Are ya kidding me? This is hand-carved mahogany."
    },
    {
      "name": "Magical Mop",
      "uses": "Infinity",
      "ticks": 1,
      "slots": 2,
      "damage": 3,
      "description": "The Magical mop can clean up any over time spell in a 1 tick action. WIth a 1 tick action you can create a 2 hexes radius slippery zone. Walking a hex in the slippery zone carries a 20% of slipping and taking 1 damage.",
      "note": "I’m Dr Itor: Jan Itor."
    }],"armour": [
    {
      "name": "Baby seal leather boots",
      "hits": 10,
      "resistance": 2,
      "description": "Whenever you loot, you can decide to discard the item you looted to obtain Black Mambaaaaa instead. This item can be found on heartless minions.",
      "note": "I’m shaking in my custom baby seal leather boots!"
    },
    {
      "name": "Ratman’ cloak",
      "hits": 5,
      "slots": 0,
      "resistance": 1,
      "description": "Consuming 1 use of Ratman’ cloak, you can fly at the speed of 1 hex per tick.",
      "note": "Flap its wings into a cave."
    },
    {
      "name": "Best employee’ suit",
      "hits": 15,
      "resistance": 2,
      "description": "Even if you are lying, any minion has a 25% chance to believe you.",
      "note": "Insert a funny joke about dressing."
    },
    {
      "name": "La maglia della salute",
      "hits": 15,
      "slots": 0,
      "resistance": 1,
      "description": "You are immune to Let it snow! This item can be found on minions.",
      "note": "What are you doing? I’m freezing! You should wear something under that shirt!"
    }],"spell": [
    {
      "name": "Open Sesame",
      "uses": "3",
      "mana": 2,
      "ticks": 2,
      "description": "Open a closed door.",
      "note": "Wait master, it might be dangerous… you go first."
    },
    {
      "name": "Forgotten songs",
      "uses": "Infinity",
      "mana": 2,
      "ticks": 1,
      "description": "This spell makes old depressing songs resonate into any unit’s head within 5 hexes for the duration of 4 ticks. They all lose 2 damage from their attacks, while spells obtain a 20% chance to fail. Earplugs do not negate this effect. If a Bard casts this spell with their instrument the damage lost is 3 instead, while the failing chance of other spells is 30%.",
      "note": "How the hell do you know Claudio Lolli!?"
    }],"misc": [
    {
      "name": "Toxic mixture",
      "uses": 1,
      "ticks": 1,
      "description": "Throw up to 3 hexes away from you. A toxic cloud is released in the target tile for the duration of 4 ticks, dealing 2 poison damage per tick.",
      "note": "Use smokescreen attack, go!"
    },
    {
      "name": "Strongest Potion",
      "uses": 1,
      "ticks": 1,
      "description": "This dense mixture has a random effect as you drink it:\n1: you die;\n2-30: you heal 5 HPs and regen 3 MPs and 3 EPs;\n31-50: you suffer 4 poison damage for 3 ticks and stay immobilized for the duration;\n51-79: you get 30% AG and your melee attacks deal 3 additional damage for 3 ticks;\n80-99: for the duration of 3 ticks you lose your AG and any action you would perform requires double the ticks;\n100: you obtain 10 resistance for the duration of 10 ticks.",
      "note": "My strongest potions would kill you traveler. You can’t handle my potions."
    },
    {
      "name": "Peter Parker’s eyeglasses",
      "slots": 0,
      "description": "Your spider senses increase your AG by 10%.",
      "note": "Oh! I was carrying a hammer this all time!"
    },
    {
      "name": "Permit A38",
      "uses": 1,
      "description": "Use it to lie without consequences to another minion.",
      "note": "I already told you once the port is down by the seaside!"
    },
    {
      "name": "Giant Trampoline",
      "description": "Whenever you fall from the tower there’s a 0-28% chance (scales linearly with luck) that this item has been conveniently left right under the window you are getting out. Giant trampoline will put you back from whence you came.",
      "note": "For the last time. We did not order a giant trampoline!"
    },
    {
      "name": "Cup of coffee",
      "uses": 1,
      "ticks": 1,
      "description": "You gain 10% AG for 3 ticks.",
      "note": "A nice warm cup of covfefe."
    }
  ]
}