{
  "items": [
    {
      "name": "Forget-me-stick",
      "uses": 1,
      "ticks": 1,
      "description": "The Forget-me-stick can be used on an hostile minion to turn them to neutral. When the minion wakes up after 3 ticks you must convince them that you’re not hostile otherwise they’ll turn back to hostile.",
      "note": "For when you’re all out of forget-me-spray."
    },
    {
      "name": "Bananarang",
      "uses": 2,
      "ticks": 1,
      "damage": 1,
      "range": 4,
      "description": "A ranged weapon that automatically comes back when you use it. Eat it to restore 1 HP",
      "note": "Its name is Jack and it comes back. Also a great source of Potassium."
    },
    {
      "name": "Papier-mâchéte",
      "uses": 2,
      "ticks": 1,
      "damage": 2,
      "note": "Gives you particularly nasty paper cuts."
    },
    {
      "name": "Lock pick",
      "uses": 5,
      "ticks": 1,
      "damage": 1,
      "note": "Ouch! It’s pointy!"
    },
    {
      "name": "Wet towel",
      "uses": 3,
      "ticks": 1,
      "damage": 1,
      "range": 2,
      "description": "Does not count as a ranged weapon.",
      "note": "Don’t make me run bitte. I’m full of chocolate."
    },
    {
      "name": "Rolling Pin",
      "uses": 3,
      "ticks": 1,
      "damage": 1,
      "description": "With a 2 ticks atomic action and 1 use of Rolling Pin, you can make Tagliatelle. Tagliatelle restore 2 HPs, MPs and EPs.",
      "note": "Un pieno di energia, effetto vitamina!"
    },
    {
      "name": "Shuriken",
      "uses": 1,
      "ticks": 1,
      "damage": 1,
      "range": 10,
      "description": "Multiple item loot.",
      "note": "So many ninja stars in the sky."
    },
    {
      "name": "Lucky charm helmet",
      "hits": 2,
      "description": "Deny a magical effect you would suffer (not the damage of a spell) and reduce by 1 the hits of Lucky charm helmet. If you are wearing this item while looting, increase your LK by 1 and destroy Lucky charm helmet.",
      "note": "It kinda forgot to be actually protective."
    },
    {
      "name": "Superior moral boots",
      "hits": 5,
      "resistance": 1,
      "description": "You gain 5% AG. You can consume 1 hit of Superior moral boots as a 1 tick action to show a minion how cool you think they are: 30% chance they lose their action in the tick.",
      "note": "They are so cool! Yeah… Awesome! Definitely not a lie."
    },
    {
      "name": "Glass slippers",
      "hits": 1,
      "resistance": 5,
      "description": "You lose 5% AG. Furthermore, you can’t throw the item Very small rock.",
      "note": "People in glass slippers should not throw rocks."
    },
    {
      "name": "Chain mail",
      "hits": 3,
      "resistance": 2,
      "note": "Forward it to at least 10 other people!"
    },
    {
      "name": "Plate of certainties",
      "hits": 3,
      "resistance": 2,
      "description": "If you also own Superior moral boots, Plate of certainties increases its resistance by 2. Whenever you lose Superior moral boots, Plate of certainties collapses. You lose 5% AG.",
      "note": "Improves over the years."
    },
    {
      "name": "Magazines",
      "hits": 5,
      "resistance": 1,
      "description": "Magazines completely negate the effect of Throwing knives.",
      "note": "Yare yare daze. Now my valuable uniform is full of holes!"
    },
    {
      "name": "Gold Armour",
      "hits": 2,
      "resistance": 3,
      "description": "You have no AG. Not so great as armour, but can be used as a bribing tool.",
      "note": "Those dwarves have too much gold for their own good!"
    },
    {
      "name": "Wait and see!",
      "uses": 2,
      "mana": 2,
      "ticks": 1,
      "description": "Your next action will require 1 tick less than usual.",
      "note": "Do not question my GENIUS!"
    },
    {
      "name": "F is for Flash",
      "uses": 2,
      "mana": 2,
      "ticks": 1,
      "description": "Blink to target location within 5 hexes",
      "note": "Because it just makes sense. Yours is on the wrong keeey."
    },
    {
      "name": "Blow me to Bermuda!",
      "uses": 1,
      "mana": 2,
      "ticks": 2,
      "interruptibility": "suspendable",
      "description": "Move up to 3 floors, take 2 damage per floor.",
      "note": "Of all the idiotic… Y-Y-Y…I..."
    },
    {
      "name": "Ghost punch",
      "uses": 3,
      "mana": 2,
      "ticks": 1,
      "range": 2,
      "damage": 2,
      "description": "Summon an evil spirit to punch the shirt out of a target. You can repeat this spell up to 3 times in the same tick by using the corresponding amount of mana.",
      "note": "ORA! ORA! ORA!"
    },
    {
      "name": "Water gun",
      "uses": 3,
      "mana": 2,
      "ticks": 1,
      "range": 3,
      "damage": 2,
      "description": "Sprays a target with a powerful jet of water extinguishing any burning flame. The target then has a 30% chance to slip and fall to take 1 additional damage. A dehydrated unit can be rehydrated with this effect.",
      "note": "Use Water gun! Go!"
    },
    {
      "name": "Yoink!",
      "uses": 2,
      "mana": 2,
      "ticks": 1,
      "role": [
        "Support",
        "Explorer"
      ],
      "description": "Tries to steal an item from a target. Choose: steal specific item with 10% probability, Item from type with 20% probability or random item with 60% probability",
      "note": "OUR equipment!"
    },
    {
      "name": "Yeet!!",
      "uses": 3,
      "mana": 2,
      "ticks": 1,
      "range": 4,
      "role": [
        "Support",
        "Explorer"
      ],
      "description": "Throw a weapon to a target. If the target is friendly, they have a 60% chance to catch it, otherwise it drops in front of them on the line of throw. If the target is hostile they take the damage from the weapon without consuming uses. Does not apply special effects.",
      "note": "This bitch for ‘nother class! YEET!"
    },
    {
      "name": "Jean-Paul Gaultier's pour homme",
      "uses": 1,
      "ticks": 1,
      "description": "Multiple item loot. Lie shamelessly to a neutral minion without any consequences.",
      "note": "It’s just my natural musk!"
    },
    {
      "name": "Mysterious lever",
      "uses": 1,
      "ticks": 1,
      "description": "A lever to hang on a wall. A minion cannot resist taking a 1 tick action to pull the lever and fall 1 floor down.",
      "note": "WRONG LEVEEEEEER!"
    },
    {
      "name": "Mana potion",
      "uses": 1,
      "ticks": 1,
      "description": "Multiple item loot. Regen up to 4 MPs..",
      "note": "Wuju pass me that potion?"
    },
    {
      "name": "Health potion",
      "uses": 1,
      "ticks": 1,
      "description": "Multiple item loot. Regen up to 3 HPs.",
      "note": "I'm fine, I'm fine… I'm gonna die!"
    },
    {
      "name": "Stamina potion",
      "uses": 1,
      "ticks": 1,
      "description": "Multiple item loot. Regen up to 4 EPs and gain 5% AG in this tick.",
      "note": "Please Asterix let me have just a drop!"
    },
    {
      "name": "Muffin",
      "uses": 1,
      "ticks": 1,
      "description": "Multiple item loot. Eat it to restore 2 HP. If you own a muffin’s factory, you can throw the Muffin for 1 damage at 2 range.",
      "note": "They really wanna die!"
    },
    {
      "name": "Die Die Die",
      "uses": 1,
      "description": "When you’re looting, you can consume 1 use, if you don’t like the item you’ve picked, put it back and roll the die again. Alternatively, consume 1 use before looting, then roll the die, but with 1 more LK.",
      "note": "He gave me loaded dice!"
    }
  ]
}